# UnspecifiedError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..UnspecifiedError Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Revit has experienced an unexpected error. The operation has been cancelled to protect your project from corruption.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnspecifiedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnspecifiedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnspecifiedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace